  // 0. Демонстрация решения
  // Напишите программу, которая на вход 
  // принимает число и выдает его квадрат (чмисло умноженноое на сомо себя).
  // Напримет 
  // 4->16
  //-3->9
  //-7-49



Console.WriteLine("Введите целое число:");
int num = Convert.ToInt32(Console.ReadLine());
int square = num * num;
Console.Write($"Квадрат числа {num} = {square}");



//Console.ReadLine();
